function verifyLogin(key) {
    let cnt = 0;
    let cookie = '';
    let content = '';
    let yzm_url = 'https://www.cpldq.com/include/vdimgck.php';
    log(`验证码链接:${yzm_url}`);
    let submit_url = 'https://www.cpldq.com/search.php?scheckAC=check&page=1&searchtype=&order=&tid=&area=&year=&letter=&yuyan=&state=&money=&ver=&jq=';
    log(`post登录链接:${submit_url}`);
    while (cnt < OCR_RETRY) {
        try {
            let {cookie, html} = reqCookie(yzm_url + '?t=' + new Date().getTime(), {toBase64: true});
            let code = OcrApi.classification(html);
            let code1 = eval(code.slice(0, -1));
            log(`第${cnt + 1}次验证码识别结果:${code}->${code1}`);
            html = post(submit_url, {
                headers: {Cookie: cookie},
                body: 'validate=' + code1 + '&searchword=' + key,
            });
            if (/相关搜索结果/.test(html)) {
                content = html;
                return {cookie, html: content} // 需要返回cookie
            } else if (!/相关搜索结果/.test(html) && cnt + 1 >= OCR_RETRY) {
                cookie = ''; // 需要清空返回cookie
            }
        } catch (e) {
            log(`第${cnt + 1}次验证码提交失败:${e.message}`);
            if (cnt + 1 >= OCR_RETRY) {
                cookie = '';
            }
        }
        cnt += 1
    }
    return {cookie, html: content}
}

globalThis.verifyLogin = verifyLogin;

var rule = {
    title: '一起看[优]',
    host: 'http://www.cpldq.com',
    url: '/cptype/fyclass-fypage.html',
    searchUrl: '/search.php?page=fypage&searchword=**&searchtype=',
    searchable: 0,
    quickSearch: 0,
    filterable: 1,
    filter: '',
    filter_url: '',
    headers: {
        'User-Agent': 'MOBILE_UA',
    },
    timeout: 5000,
    //class_parse: '.sb_login_alert_box&&li;a&&Text;a&&href;/(\\d+)\.html',
    class_name:'电视剧&电影&动漫&短剧&综艺',
    class_url:'2&1&4&30&3',
    cate_exclude: '',
    play_parse: true,
    lazy: $js.toString(() => {
        input = {parse: 1, url: input, js: ''};
    }),
    double: true,
	filter: {
"1":[{"key":"class","name":"剧情","value":[{"n":"全部剧情","v":""},{"n":"乡村","v":"乡村"},{"n":"都市","v":"都市"},{"n":"少儿","v":"少儿"},{"n":"对话","v":"对话"},{"n":"搞笑","v":"搞笑"},{"n":"恐怖","v":"恐怖"},{"n":"宫廷","v":"宫廷"},{"n":"剧情","v":"剧情"},{"n":"言情","v":"言情"},{"n":"家庭","v":"家庭"},{"n":"励志","v":"励志"},{"n":"偶像","v":"偶像"},{"n":"时装","v":"时装"},{"n":"年代","v":"年代"},{"n":"悬疑","v":"悬疑"},{"n":"古装","v":"古装"},{"n":"热血","v":"热血"},{"n":"同人","v":"同人"},{"n":"耽美","v":"耽美"}]},{"key":"area","name":"地区","value":[{"n":"全部地区","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},{"key":"year","name":"时间","value":[{"n":"全部时间","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"更早","v":"more"}]},{"key":"by","name":"排序","value":[{"n":"全部排序","v":""},{"n":"时间排序","v":"time"},{"n":"人气排序","v":"hits"},{"n":"评分排序","v":"score"}]}],
"2":[{"key":"class","name":"剧情","value":[{"n":"全部剧情","v":""},{"n":"乡村","v":"乡村"},{"n":"都市","v":"都市"},{"n":"少儿","v":"少儿"},{"n":"对话","v":"对话"},{"n":"搞笑","v":"搞笑"},{"n":"恐怖","v":"恐怖"},{"n":"宫廷","v":"宫廷"},{"n":"剧情","v":"剧情"},{"n":"言情","v":"言情"},{"n":"家庭","v":"家庭"},{"n":"励志","v":"励志"},{"n":"偶像","v":"偶像"},{"n":"时装","v":"时装"},{"n":"年代","v":"年代"},{"n":"悬疑","v":"悬疑"},{"n":"古装","v":"古装"},{"n":"热血","v":"热血"},{"n":"同人","v":"同人"},{"n":"耽美","v":"耽美"}]},{"key":"area","name":"地区","value":[{"n":"全部地区","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},{"key":"year","name":"时间","value":[{"n":"全部时间","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"更早","v":"more"}]},{"key":"by","name":"排序","value":[{"n":"全部排序","v":""},{"n":"时间排序","v":"time"},{"n":"人气排序","v":"hits"},{"n":"评分排序","v":"score"}]}],
"3":[{"key":"class","name":"剧情","value":[{"n":"全部剧情","v":""},{"n":"乡村","v":"乡村"},{"n":"都市","v":"都市"},{"n":"少儿","v":"少儿"},{"n":"对话","v":"对话"},{"n":"搞笑","v":"搞笑"},{"n":"恐怖","v":"恐怖"},{"n":"宫廷","v":"宫廷"},{"n":"剧情","v":"剧情"},{"n":"言情","v":"言情"},{"n":"家庭","v":"家庭"},{"n":"励志","v":"励志"},{"n":"偶像","v":"偶像"},{"n":"时装","v":"时装"},{"n":"年代","v":"年代"},{"n":"悬疑","v":"悬疑"},{"n":"古装","v":"古装"},{"n":"热血","v":"热血"},{"n":"同人","v":"同人"},{"n":"耽美","v":"耽美"}]},{"key":"area","name":"地区","value":[{"n":"全部地区","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},{"key":"year","name":"时间","value":[{"n":"全部时间","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"更早","v":"more"}]},{"key":"by","name":"排序","value":[{"n":"全部排序","v":""},{"n":"时间排序","v":"time"},{"n":"人气排序","v":"hits"},{"n":"评分排序","v":"score"}]}],
"4":[{"key":"class","name":"剧情","value":[{"n":"全部剧情","v":""},{"n":"乡村","v":"乡村"},{"n":"都市","v":"都市"},{"n":"少儿","v":"少儿"},{"n":"对话","v":"对话"},{"n":"搞笑","v":"搞笑"},{"n":"恐怖","v":"恐怖"},{"n":"宫廷","v":"宫廷"},{"n":"剧情","v":"剧情"},{"n":"言情","v":"言情"},{"n":"家庭","v":"家庭"},{"n":"励志","v":"励志"},{"n":"偶像","v":"偶像"},{"n":"时装","v":"时装"},{"n":"年代","v":"年代"},{"n":"悬疑","v":"悬疑"},{"n":"古装","v":"古装"},{"n":"热血","v":"热血"},{"n":"同人","v":"同人"},{"n":"耽美","v":"耽美"}]},{"key":"area","name":"地区","value":[{"n":"全部地区","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},{"key":"year","name":"时间","value":[{"n":"全部时间","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"更早","v":"more"}]},{"key":"by","name":"排序","value":[{"n":"全部排序","v":""},{"n":"时间排序","v":"time"},{"n":"人气排序","v":"hits"},{"n":"评分排序","v":"score"}]}],
"30":[{"key":"class","name":"剧情","value":[{"n":"全部剧情","v":""},{"n":"乡村","v":"乡村"},{"n":"都市","v":"都市"},{"n":"少儿","v":"少儿"},{"n":"对话","v":"对话"},{"n":"搞笑","v":"搞笑"},{"n":"恐怖","v":"恐怖"},{"n":"宫廷","v":"宫廷"},{"n":"剧情","v":"剧情"},{"n":"言情","v":"言情"},{"n":"家庭","v":"家庭"},{"n":"励志","v":"励志"},{"n":"偶像","v":"偶像"},{"n":"时装","v":"时装"},{"n":"年代","v":"年代"},{"n":"悬疑","v":"悬疑"},{"n":"古装","v":"古装"},{"n":"热血","v":"热血"},{"n":"同人","v":"同人"},{"n":"耽美","v":"耽美"}]},{"key":"area","name":"地区","value":[{"n":"全部地区","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},{"key":"year","name":"时间","value":[{"n":"全部时间","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"更早","v":"more"}]},{"key":"by","name":"排序","value":[{"n":"全部排序","v":""},{"n":"时间排序","v":"time"},{"n":"人气排序","v":"hits"},{"n":"评分排序","v":"score"}]}]},
    推荐: '.main&&.bgte1130;ul&&.sb-film-one;*;*;*;*',
    一级: '.sb-area-index&&ul&&.qcontainer;i&&Text;.lazy&&data-original;.other&&Text;a&&href',
    二级: {
        title: '.name&&Text;.ct&&dd&&Text',
        img: '.lazy&&data-original',
        desc: '.ct&&dd:eq(1)&&Text;.ct&&dd:eq(2)&&Text;.ct&&dt:eq(2)&&Text;.ct&&dt&&Text;',
        content: 'div.ee&&Text',
        tabs: '.playfrom&&li',
        lists: '.playlist:eq(#id)&&ul&&li:not(:contains(滈凊))',
        tab_text: 'body--sup&&Text',
        list_text: 'body&&Text',
        list_url: 'a&&href'
    },
    tab_rename:{'秒播资源':'🌺风言锋语88🌺+秒播','光速资源':'🌺风言锋语88🌺+光速'},
    //搜索: '*',
    搜索: $js.toString(() => {
        let cookie = getItem(RULE_CK, '') + ';ssea2_search=ok';
        log('储存的cookie:' + cookie);
        let ret = request(MY_URL, {
            headers: {
                Cookie: cookie,
            }
        });
        if (/系统安全验证/.test(ret)) {
            let login = verifyLogin(KEY);
            cookie = login.cookie;
            if (cookie) {
                log(`本次成功过验证,cookie:${cookie}`);
                setItem(RULE_CK, cookie);
            } else {
                log(`本次自动过搜索验证失败,cookie:${cookie}`);
            }
            ret = login.html;
            // ret = request(MY_URL, {
            //     headers: {
            //         Cookie: cookie,
            //     }
            // });
        }
        let d = [];
        let p = rule.一级.split(';');
        let arr = pdfa(ret, p[0]);
        arr.forEach(it => {
            d.push({
                title: pdfh(it, p[1]),
                pic_url: pdfh(it, p[2]),
                desc: pdfh(it, p[3]),

                url: pdfh(it, p[4]),
                content: '',
            });

        });
        setResult(d);
    }),
}